# CargoDefect-YOLOv26-P2-Detect: PGME + 4-scale P2/P3/P4/P5 + standard Detect Head
# The original CargoDefect model already has P2/P3/P4/P5 neck (PGME creates extra stage).
# This config is identical to cargodefect-yolov26-detect but with explicit P2 naming.
# nc=2 (package, defect), standard YOLO detection labels

nc: 2
end2end: True
reg_max: 1

# PGME domain fusion switches
use_edge_branch: True
use_frequency_branch: True

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone: PGME at layer 2 for edge+freq+RGB domain fusion
backbone:
  - [-1, 1, nn.Identity, []]                           # 0:  640x640
  - [-1, 1, Conv, [64, 3, 2]]                          # 1:  320x320, 64ch
  - [[0, 1], 1, PGME, [64]]                             # 2:  PGME domain fusion, 64ch
  - [-1, 1, Conv, [128, 3, 2]]                         # 3:  160x160, 128ch (P2 source)
  - [-1, 2, C3k2, [256, False, 0.25]]                  # 4:  P2 block, 256ch
  - [-1, 1, Conv, [256, 3, 2]]                         # 5:  80x80, 256ch (P3 source)
  - [-1, 2, C3k2, [512, False, 0.25]]                  # 6:  P3 block, 512ch
  - [-1, 1, Conv, [512, 3, 2]]                         # 7:  40x40, 512ch (P4 source)
  - [-1, 2, C3k2, [512, True]]                         # 8:  P4 block, 512ch
  - [-1, 1, Conv, [1024, 3, 2]]                        # 9:  20x20, 1024ch (P5 source)
  - [-1, 2, C3k2, [1024, True]]                        # 10: P5 block, 1024ch
  - [-1, 1, SPPF, [1024, 5, 3, True]]                  # 11: SPPF
  - [-1, 2, C2PSA, [1024]]                             # 12: C2PSA

# Neck: FPN+PAN generating 4 detection scales
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]         # 13: up P5
  - [[-1, 8], 1, Concat, [1]]                           # 14: cat(up, P4)
  - [-1, 2, C3k2, [512, True]]                         # 15: FPN P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]         # 16: up
  - [[-1, 6], 1, Concat, [1]]                           # 17: cat(up, P3)
  - [-1, 2, C3k2, [256, True]]                         # 18: FPN P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]         # 19: up
  - [[-1, 4], 1, Concat, [1]]                           # 20: cat(up, P2)
  - [-1, 2, C3k2, [128, True]]                         # 21: P2 detect (160x160, 128ch)
  - [-1, 1, Conv, [128, 3, 2]]                         # 22: down P2
  - [[-1, 18], 1, Concat, [1]]                          # 23: cat(down, FPN_P3)
  - [-1, 2, C3k2, [256, True]]                         # 24: P3 detect (80x80, 256ch)
  - [-1, 1, Conv, [256, 3, 2]]                         # 25: down P3
  - [[-1, 15], 1, Concat, [1]]                          # 26: cat(down, FPN_P4)
  - [-1, 2, C3k2, [512, True]]                         # 27: P4 detect (40x40, 512ch)
  - [-1, 1, Conv, [512, 3, 2]]                         # 28: down P4
  - [[-1, 12], 1, Concat, [1]]                          # 29: cat(down, backbone)
  - [-1, 1, C3k2, [1024, True, 0.5, True]]             # 30: P5 detect (20x20, 1024ch)
  # Standard 4-scale Detect Head (nc=2)
  - [[21, 24, 27, 30], 1, Detect, [nc]]                 # 31: Detect(P2, P3, P4, P5)
