# CargoDefect-YOLOv26-P2-DEB: P2 four-scale + DefectEnhanceBlock
# Standard Detect head, nc=2 (package, defect)
# DEB placed at P2 and P3 branches for small defect enhancement

nc: 2
end2end: True
reg_max: 1
use_defect_enhance: True
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0: 320x320
  - [-1, 1, Conv, [128, 3, 2]]             # 1: 160x160
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2: 160x160, 64ch
  - [-1, 1, Conv, [256, 3, 2]]             # 3: 80x80
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4: 80x80, 128ch
  - [-1, 1, Conv, [512, 3, 2]]             # 5: 40x40
  - [-1, 2, C3k2, [512, True]]             # 6: 40x40, 128ch
  - [-1, 1, Conv, [1024, 3, 2]]            # 7: 20x20
  - [-1, 2, C3k2, [1024, True]]            # 8: 20x20, 512ch
  - [-1, 1, SPPF, [1024, 5, 3, True]]      # 9: 20x20, 512ch
  - [-1, 2, C2PSA, [1024]]                 # 10: 20x20, 512ch

head:
  # FPN top-down
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 11
  - [[-1, 6], 1, Concat, [1]]                          # 12
  - [-1, 2, C3k2, [512, True]]                         # 13: fpn_p4 128ch
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]         # 14
  - [[-1, 4], 1, Concat, [1]]                           # 15
  - [-1, 2, C3k2, [256, True]]                          # 16: fpn_p3 64ch
  # P2 branch
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 17
  - [[-1, 2], 1, Concat, [1]]                            # 18
  - [-1, 1, DefectEnhanceBlock, []]                      # 19: DEB on P2
  - [-1, 2, C3k2, [256, True]]                           # 20: P2 output 64ch at 160x160
  # PAN P2→P3
  - [-1, 1, Conv, [256, 3, 2]]                           # 21
  - [[-1, 16], 1, Concat, [1]]                            # 22
  - [-1, 1, DefectEnhanceBlock, []]                       # 23: DEB on P3
  - [-1, 2, C3k2, [256, True]]                            # 24: P3 output 64ch at 80x80
  # PAN P3→P4
  - [-1, 1, Conv, [256, 3, 2]]                            # 25
  - [[-1, 13], 1, Concat, [1]]                             # 26
  - [-1, 2, C3k2, [512, True]]                             # 27: P4 output 128ch at 40x40
  # PAN P4→P5
  - [-1, 1, Conv, [512, 3, 2]]                             # 28
  - [[-1, 10], 1, Concat, [1]]                              # 29
  - [-1, 1, C3k2, [1024, True, 0.5, True]]                 # 30: P5 output 512ch at 20x20
  # Detect
  - [[20, 24, 27, 30], 1, Detect, [nc]]                     # 31
