# CargoDefect-YOLOv26-P2: P2/P3/P4/P5 four-scale detection head
# Based on yolov26n-package-defect with added P2 branch for small defect detection
# Standard Detect head, nc=2 (package, defect)

nc: 2
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone: identical to yolov26n-base
# Strides: 2, 4, 8, 16, 32
# Layer 2: C3k2[256] → 64ch at 160x160 (stride 4) — P2 source
# Layer 4: C3k2[512] → 128ch at 80x80 (stride 8) — P3 source
# Layer 6: C3k2[512] → 128ch at 40x40 (stride 16) — P4 source
# Layer 10: C2PSA[1024] → 512ch at 20x20 (stride 32) — P5 source
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0: 320x320
  - [-1, 1, Conv, [128, 3, 2]]             # 1: 160x160
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2: 160x160, 64ch ← P2 source
  - [-1, 1, Conv, [256, 3, 2]]             # 3: 80x80
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4: 80x80, 128ch ← P3 source
  - [-1, 1, Conv, [512, 3, 2]]             # 5: 40x40
  - [-1, 2, C3k2, [512, True]]             # 6: 40x40, 128ch ← P4 source
  - [-1, 1, Conv, [1024, 3, 2]]            # 7: 20x20
  - [-1, 2, C3k2, [1024, True]]            # 8: 20x20, 512ch
  - [-1, 1, SPPF, [1024, 5, 3, True]]      # 9: 20x20, 512ch
  - [-1, 2, C2PSA, [1024]]                 # 10: 20x20, 512ch ← P5 source

# Head: FPN (top-down) + P2 branch + PAN (bottom-up with P2→P3→P4→P5)
# 
# FPN path: layer 10(C2PSA 512ch) → up + cat[6] → layer 13(128ch) → up + cat[4] → layer 16(64ch)
# P2 branch: layer 16 → up + cat[2] → layer 19(64ch) ← P2 output
# PAN path: layer 19 → down + cat[16] → layer 22(64ch) ← P3 output
#            layer 22 → down + cat[13] → layer 25(128ch) ← P4 output
#            layer 25 → down + cat[10] → layer 28(512ch) ← P5 output
head:
  # FPN: top-down (P5→P4)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 11: upsample layer 10
  - [[-1, 6], 1, Concat, [1]]                          # 12: cat(11, 6) → 512+128=640ch
  - [-1, 2, C3k2, [512, True]]                         # 13: fpn_p4 → 128ch
  # FPN: P4→P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]         # 14: upsample layer 13
  - [[-1, 4], 1, Concat, [1]]                           # 15: cat(14, 4) → 128+128=256ch
  - [-1, 2, C3k2, [256, True]]                          # 16: fpn_p3 → 64ch
  # P2 branch: upsample from fpn_p3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 17: upsample layer 16
  - [[-1, 2], 1, Concat, [1]]                            # 18: cat(17, 2) → 64+64=128ch
  - [-1, 2, C3k2, [256, True]]                           # 19: P2 output → 64ch at 160x160
  # PAN: P2→P3
  - [-1, 1, Conv, [256, 3, 2]]                           # 20: down P2 → 80x80, 64ch
  - [[-1, 16], 1, Concat, [1]]                            # 21: cat(20, 16) → 64+64=128ch
  - [-1, 2, C3k2, [256, True]]                            # 22: P3 output → 64ch at 80x80
  # PAN: P3→P4
  - [-1, 1, Conv, [256, 3, 2]]                            # 23: down P3 → 40x40, 64ch
  - [[-1, 13], 1, Concat, [1]]                             # 24: cat(23, 13) → 64+128=192ch
  - [-1, 2, C3k2, [512, True]]                             # 25: P4 output → 128ch at 40x40
  # PAN: P4→P5
  - [-1, 1, Conv, [512, 3, 2]]                             # 26: down P4 → 20x20, 128ch
  - [[-1, 10], 1, Concat, [1]]                              # 27: cat(26, 10) → 128+512=640ch
  - [-1, 1, C3k2, [1024, True, 0.5, True]]                 # 28: P5 output → 512ch at 20x20
  # Detect: P2, P3, P4, P5
  - [[19, 22, 25, 28], 1, Detect, [nc]]                     # 29: four-scale detection
